<a href="https://colab.research.google.com/github/jethompson023/CS-491/blob/main/CS491Assignment_2.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [ ]:
import numpy as np 
import pandas as pd

1) Create a Series that contains the first 10 prime numbers. Write Python code to generate the numbers. It is ok to use a loop for this question.

In [ ]:
pn = pd.Series([], dtype=int)
num = 2
while len(pn) < 10:
    flag = False
    for i in range(2, num):
        if num % i == 0:
            flag = True
            break
    if not flag:
        pn = pn.append(pd.Series([num], index=[len(pn)]))
    num += 1
print(pn)

0     2
1     3
2     5
3     7
4    11
5    13
6    17
7    19
8    23
9    29
dtype: int64

2) Write code that selects the prime numbers at the odd positions (1,3,5, ..) of the series. Use the iloc method.

In [ ]:
print(pn.iloc[1:10:1]) # This isn't correct

1     3
2     5
3     7
4    11
5    13
6    17
7    19
8    23
9    29
dtype: int64

3) Create the following data frame. Do not set an index (it should use the default index). The index is not shown in the picture below.

In [ ]:
d1 = pd.DataFrame(
      {'id': ['2', '5', '10', '15', '20'], 
      'First_Name': ['Jason', 'Jason', 'Tina', 'Jake', 'Amy'],
      'Last_Name': ['Miller', 'Jacobson', 'Ali', 'Milner', 'Cooze'], 
      'Age': ['42', '52', '36', '24', '73'],
      'preTestScore': ['4', '24', '31', '2', '3'], 
      'postTestScore': ['25', '94', '57', '62', '70']})
df = pd.DataFrame(d1)
df

   id First_Name Last_Name Age preTestScore postTestScore
0   2      Jason    Miller  42            4            25
1   5      Jason  Jacobson  52           24            94
2  10       Tina       Ali  36           31            57
3  15       Jake    Milner  24            2            62
4  20        Amy     Cooze  73            3            70

4) Make id the index attribute.

In [ ]:
df.set_index('id')
df

   id First_Name Last_Name Age preTestScore postTestScore
0   2      Jason    Miller  42            4            25
1   5      Jason  Jacobson  52           24            94
2  10       Tina       Ali  36           31            57
3  15       Jake    Milner  24            2            62
4  20        Amy     Cooze  73            3            70

5) Show the first names in the data frame.

In [ ]:
print(df.First_Name.to_string(index=False))

 Jason
 Jason
  Tina
  Jake
   Amy

6) Show the age of Tina.

In [ ]:
print(df[['Age']].iloc[2])

Age    36
Name: 2, dtype: object

7) What is the mean difference between the preTestSocre and postTestScore?

In [ ]:
mean = df[['preTestScore', 'postTestScore']].mean()
print(mean)

preTestScore        848624.6
postTestScore    518915254.0
dtype: float64

8) Make the postTestScore of Amy and Jake to be not-a-number.*

9) Show all rows in the data frame, where all values are different from not-a-number.

10) Reset the index. Then make the first name and last name together to be the key.

In [ ]:
#Reset the Index to orginal and make sure this change becomes True
df.reset_index(drop=True)

#Change the Key to First and Last Name 
newKey = df[['First_Name', 'Last_Name']].keys()
newKey

Index(['First_Name', 'Last_Name'], dtype='object')

In [ ]:
df.set_index('0', '1', '2', '3', '4', '5')
df

11) Show the age of Tina using the new data frame.

In [ ]:
tdf = df[['Age']].iloc[2]
new_df = pd.DataFrame(tdf)
new_df